perf/results/heavy/node_replicated_spike_output.txt
> perf@1.0.0 artillery /home/tony/Desktop/tp1arqsoft/perf
> artillery "run" "heavy.yaml" "-e" "node_replicated"

Started phase 0 (Reset), duration: 10s @ 18:18:28(-0300) 2020-11-10
Report @ 18:18:38(-0300) 2020-11-10
Elapsed time: 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Started phase 1 (Ramp), duration: 10s @ 18:18:38(-0300) 2020-11-10
Report @ 18:18:48(-0300) 2020-11-10
Elapsed time: 20 seconds
  Scenarios launched:  13
  Scenarios completed: 4
  Requests completed:  4
  Mean response/sec: 1.69
  Response time (msec):
    min: 3089.7
    max: 3121.1
    median: 3096.6
    p95: 3121.1
    p99: 3121.1
  Codes:
    200: 4

Started phase 2 (Plain), duration: 10s @ 18:18:49(-0300) 2020-11-10
Report @ 18:18:58(-0300) 2020-11-10
Elapsed time: 30 seconds
  Scenarios launched:  19
  Scenarios completed: 6
  Requests completed:  6
  Mean response/sec: 1.94
  Response time (msec):
    min: 4652.5
    max: 7684.3
    median: 6162.9
    p95: 7684.3
    p99: 7684.3
  Codes:
    200: 6

Started phase 3 (Spike-up), duration: 20s @ 18:18:59(-0300) 2020-11-10
Report @ 18:19:08(-0300) 2020-11-10
Elapsed time: 40 seconds
  Scenarios launched:  75
  Scenarios completed: 7
  Requests completed:  7
  Mean response/sec: 7.51
  Response time (msec):
    min: 8616.3
    max: 13062.9
    median: 10139.4
    p95: 13062.9
    p99: 13062.9
  Codes:
    200: 7

Report @ 18:19:18(-0300) 2020-11-10
Elapsed time: 50 seconds
  Scenarios launched:  219
  Scenarios completed: 7
  Requests completed:  7
  Mean response/sec: 22.16
  Response time (msec):
    min: 13059.1
    max: 17929.8
    median: 16080.4
    p95: 17929.8
    p99: 17929.8
  Codes:
    200: 7

Started phase 4 (Spike-down), duration: 20s @ 18:19:19(-0300) 2020-11-10
Report @ 18:19:28(-0300) 2020-11-10
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  245
  Scenarios completed: 6
  Requests completed:  6
  Mean response/sec: 24.52
  Response time (msec):
    min: 19290.3
    max: 23788.9
    median: 21062.9
    p95: 23788.9
    p99: 23788.9
  Codes:
    200: 6
  Errors:
    ECONNRESET: 30

Report @ 18:19:38(-0300) 2020-11-10
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  97
  Scenarios completed: 6
  Requests completed:  6
  Mean response/sec: 9.78
  Response time (msec):
    min: 26155.5
    max: 31694.8
    median: 29038.1
    p95: 31694.8
    p99: 31694.8
  Codes:
    200: 6
  Errors:
    ECONNRESET: 91

Started phase 5 (Reset), duration: 10s @ 18:19:39(-0300) 2020-11-10
Report @ 18:19:48(-0300) 2020-11-10
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  2
  Scenarios completed: 8
  Requests completed:  8
  Mean response/sec: 0.2
  Response time (msec):
    min: 34075.9
    max: 42242.6
    median: 38211.2
    p95: 42242.6
    p99: 42242.6
  Codes:
    200: 8

Report @ 18:19:58(-0300) 2020-11-10
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  0
  Scenarios completed: 6
  Requests completed:  6
  Mean response/sec: NaN
  Response time (msec):
    min: 44505.9
    max: 50320.5
    median: 47483.7
    p95: 50320.5
    p99: 50320.5
  Codes:
    200: 6

Report @ 18:20:08(-0300) 2020-11-10
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  0
  Scenarios completed: 26
  Requests completed:  26
  Mean response/sec: NaN
  Response time (msec):
    min: 52749.1
    max: 60037.2
    median: 60007.8
    p95: 60030.7
    p99: 60037.2
  Codes:
    200: 6
    502: 20

Report @ 18:20:18(-0300) 2020-11-10
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  0
  Scenarios completed: 219
  Requests completed:  219
  Mean response/sec: NaN
  Response time (msec):
    min: 60001.2
    max: 60225.7
    median: 60011.6
    p95: 60123.2
    p99: 60209.7
  Codes:
    502: 219

Report @ 18:20:28(-0300) 2020-11-10
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  0
  Scenarios completed: 216
  Requests completed:  216
  Mean response/sec: NaN
  Response time (msec):
    min: 59999.9
    max: 60053.9
    median: 60005
    p95: 60030
    p99: 60047.4
  Codes:
    502: 216

Report @ 18:20:38(-0300) 2020-11-10
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 6
  Requests completed:  6
  Mean response/sec: NaN
  Response time (msec):
    min: 60006
    max: 60047.3
    median: 60019.8
    p95: 60047.3
    p99: 60047.3
  Codes:
    502: 6

Report @ 18:20:48(-0300) 2020-11-10
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: NaN
  Response time (msec):
    min: 60002.4
    max: 60004.8
    median: 60003.6
    p95: 60004.8
    p99: 60004.8
  Codes:
    502: 2
  Errors:
    ESOCKETTIMEDOUT: 5

Report @ 18:20:58(-0300) 2020-11-10
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  0
  Scenarios completed: 1
  Requests completed:  1
  Mean response/sec: NaN
  Response time (msec):
    min: 120006.6
    max: 120006.6
    median: 120006.6
    p95: 120006.6
    p99: 120006.6
  Codes:
    502: 1
  Errors:
    ESOCKETTIMEDOUT: 5

Report @ 18:21:07(-0300) 2020-11-10
Elapsed time: 2 minutes, 39 seconds
  Scenarios launched:  0
  Scenarios completed: 6
  Requests completed:  6
  Mean response/sec: NaN
  Response time (msec):
    min: 120002.6
    max: 120040.5
    median: 120010.5
    p95: 120040.5
    p99: 120040.5
  Codes:
    502: 6
  Errors:
    ESOCKETTIMEDOUT: 13

All virtual users finished
Summary report @ 18:21:07(-0300) 2020-11-10
  Scenarios launched:  670
  Scenarios completed: 526
  Requests completed:  526
  Mean response/sec: 4.57
  Response time (msec):
    min: 3089.7
    max: 120040.5
    median: 60005.5
    p95: 60065
    p99: 120005.7
  Scenario counts:
    Heavy (/heavy): 670 (100%)
  Codes:
    200: 56
    502: 470
  Errors:
    ECONNRESET: 121
    ESOCKETTIMEDOUT: 23